#include "GameLevel.h"
#include <Actor/King.h>
#include <Actor/MiniShip.h>
#include <Render/Renderer.h>

using namespace Craft;
GameLevel::GameLevel()
{
	grid = {
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
	};
}

void GameLevel::OnInitialized()
{
	Level::OnInitialized();

	SpawnActor<King>();
	SpawnActor<MiniShip>();
}

void GameLevel::Tick(float deltaTime)
{
	Level::Tick(deltaTime);
}

void GameLevel::Draw()
{
	super::Draw();
	for (int i = 0; i < static_cast<int>(grid.size()); ++i)
	{
			Renderer::Get().Submit(
				StringMap(grid[i]),
				Vector2(0,i),
				Color::White,
				-1);
	}
	
}

std::string GameLevel::StringMap(const std::vector<int>& row)
{
	static HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);

	    // grid 순회하면서 글자 그리기.
		//문자열로 만들 줄
		std::string line;
		for (int x = 0; x < (int)row.size(); ++x)
		{
			// 타일값에 따라 글자 색상 및 글자 지정해서 출력.
			if (row[x] == 0)
			{
				line += '0';
			}
			else if (row[x] == 1)
			{
				line += '1';
			}
		}
		return line;
}



std::vector<Vector2> GameLevel::FindPath(const Vector2& startPosition, const Vector2& goalPosition)
{
	return aStar.FindPath(startPosition, goalPosition, grid);
}



